import { Grid } from '@mui/material';
import ReviewCard from './ReviewCard';
import Review1 from '../../img/Review1.png';
import Review2 from '../../img/Review2.png';
import Review3 from '../../img/Review3.png';
import Review4 from '../../img/Review4.png';
import Review5 from '../../img/Review5.png';
import Review6 from '../../img/Review6.png';
import Review7 from '../../img/Review7.png';
import { useMobile } from '../../hooks/useMobile';

const reviews = [
  {
    title: 'Книжни криле',
    link: 'https://knijnikrile.wordpress.com/2021/01/29/%d0%be%d1%81%d0%bc%d0%be%d1%82%d0%be-%d0%ba%d1%80%d0%b0%d0%bb%d1%81%d1%82%d0%b2%d0%be-%d0%be%d1%82-%d1%81%d1%82%d0%b5%d1%84%d0%b0%d0%bd%d0%b8%d1%8f-%d0%bc%d0%b8%d1%82%d0%b5%d0%b2/',
    img: Review1,
    description: `Стефания Митева е едва на десет, но вече има зад гърба си издадена
        книга. Нещо повече – приказната история „Осмото кралство” се ражда
        докато Стефи е още на седем! Впечатляващо, нали? Нека разлистим заедно
        дебютната приказка на младата писателка.`,
  },
  {
    title: 'Бисерче вълшебно',
    link: 'https://www.youtube.com/watch?v=zTvyov6e0n0',
    img: Review2,
    description: `Стефи Митева е в предучилищна група, когато започва да пише своите приказки. 
    Първата й книга е „Осмото кралство“, а Стефи е най-младият автор, участвал в Награда „Бисерче вълшебно“ 2020.`,
  },
  {
    title: 'А. Цонков – Lostov',
    link: 'https://lostov.com/book_reviews/the-8th-kingdom-stefi-miteva/',
    img: Review3,
    description: `Осмото кралство е едно много приятно и нестандартно попълнение в родната ни литература, поради факта, че авторката Стефания Митева е била едва на седем, 
    когато е писала тази книжка. Възраст, на която повечето деца се учат да четат, малката Стефи се захваща да измисли и сътвори с голямо желание и удоволствие този приказен свят.`,
  },
  {
    title: 'Книжно момиче',
    link: 'https://knizhnomomiche.blogspot.com/2019/11/blog-post.html',
    img: Review4,
    description: `Предупреждавам те честно – пътят не е нито лек, нито добре поддържан, а пълен с изненадващи обрати, понякога – почти несъществуващ. 
    В кралствата, които ще пребродиш, невинаги посрещат със „заешко с ориз и чай“ и рядко ти предоставят възможността да отдъхнеш под сянката на висока палма. 
    Отвсякъде те дебнат препятствия, зълклинания и капани, ще се натъкнеш и на… не, няма да издам, провери сам : P`,
  },
  {
    title: 'Никола Райков',
    subTitle: 'Автор на "Голямото приключение на малкото таласъмче"',
    link: null,
    img: Review5,
    description: `Трябва да призная, че съм изключително щастлив, че моето творчество е дало допълнителен стимул на Стефи да пише и създава приказки. 
    „Осмото кралство“ е история разказана по един очарователно детски начин, с хрумки, които биха се появили само в съзнанието на дете. 
    Надявам се, че това е само първата книга на една бъдеща писателка!`,
  },
  {
    title: 'Николай Инколов - Козия',
    subTitle: 'Aвтор на „Петият принц: Разрушител“',
    link: null,
    img: Review6,
    description: `Трябва да призная, че съм изключително щастлив, че моето творчество е дало допълнителен стимул на Стефи да пише и създава приказки. 
    „Осмото кралство“ е история разказана по един очарователно детски начин, с хрумки, които биха се появили само в съзнанието на дете. 
    Надявам се, че това е само първата книга на една бъдеща писателка!`,
  },
  {
    title: 'Снежа Желязкова',
    subTitle: 'Писателка, илюстраторка и учителка на Стефи в детската градина',
    link: null,
    img: Review7,
    description: `Трябва да призная, че съм изключително щастлив, че моето творчество е дало допълнителен стимул на Стефи да пише и създава приказки. 
    „Осмото кралство“ е история разказана по един очарователно детски начин, с хрумки, които биха се появили само в съзнанието на дете. 
    Надявам се, че това е само първата книга на една бъдеща писателка!`,
  },
];

function Reviews() {
  const isMobile = useMobile();
  return (
    <Grid
      container
      item
      sx={{
        height: 'fit-content',
        borderRadius: 5,
      }}
      px={isMobile ? 3 : 0}
    >
      {reviews.map((review, i) => {
        return <ReviewCard key={i} review={review} />;
      })}
    </Grid>
  );
}

export default Reviews;
